app/controllers/orders_controller.rb

	def create
		order = Order.new(recipe_name: params[:recipe_name], recipe_price: params[:recipe_price], recipe_quantity: params[:recipe_quantity],photo: params[:photo] )
        order.save
---
INSERT INTO "orders" ("recipe_name", "recipe_price", "recipe_quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["recipe_name", "New"], ["recipe_price", 55], ["recipe_quantity", 5], ["created_at", "2020-12-08 09:58:27.539437"], ["updated_at", "2020-12-08 09:58:27.539437"]]

	def index
       @orders = Order.all
		respond_to do |format|
            format.json do
            	json = @orders.map do |order|
---
SELECT "orders".* FROM "orders"

	def destroy
       @orders = Order.find(params[:id])
       @orders.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 135], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 135]]